DeleteViewport Method
 Removes a viewport from the sheet by deleting it from the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void DeleteViewport(
	Viewport viewport
)
Visual Basic
Public Sub DeleteViewport ( _
	viewport As Viewport _
)
Visual C++
public:
void DeleteViewport(
	Viewport^ viewport
)
Parameters
viewport
Type: Autodesk.Revit.DBViewport
 The viewport that will be deleted and removed from the sheet.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →